# IdeaStatiCa.ConnectionApi.Model.ConGridGeometry

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Type** | **ConGridGeometryType** |  | [optional]
**ShearPlaneInThread** | **bool** |  | [optional]
**RowsGridLayout** | **ConGridLayout** |  | [optional]
**TopLayers** | **ConGridPositions** |  | [optional]
**BottomLayers** | **ConGridPositions** |  | [optional]
**LeftLayers** | **ConGridPositions** |  | [optional]
**RightLayers** | **ConGridPositions** |  | [optional]
**PolarInput** | **ConPolarInputType** |  | [optional]
**Radii** | **ConGridPositions** |  | [optional]
**PolarCounts** | **List&lt;int&gt;** |  | [optional]
**Angles** | **ConGridPositions** |  | [optional]
**UserPositions** | **List&lt;ConFastenerPosition&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)